validation/load-tests/P09-k6-baseline-output.txt

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: load-tests/baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 3m10s max duration (incl. graceful stop):
              * baseline: Up to 5 looping VUs for 3m0s over 3 stages (gracefulRampDown: 10s, gracefulStop: 30s)


running (0m01.0s), 1/5 VUs, 2 complete and 0 interrupted iterations
baseline   [   1% ] 1/5 VUs  0m01.0s/3m00.0s

running (0m02.0s), 1/5 VUs, 4 complete and 0 interrupted iterations
baseline   [   1% ] 1/5 VUs  0m02.0s/3m00.0s

running (0m03.0s), 1/5 VUs, 5 complete and 0 interrupted iterations
baseline   [   2% ] 1/5 VUs  0m03.0s/3m00.0s

running (0m04.0s), 1/5 VUs, 8 complete and 0 interrupted iterations
baseline   [   2% ] 1/5 VUs  0m04.0s/3m00.0s

running (0m05.0s), 1/5 VUs, 9 complete and 0 interrupted iterations
baseline   [   3% ] 1/5 VUs  0m05.0s/3m00.0s

running (0m06.0s), 1/5 VUs, 10 complete and 0 interrupted iterations
baseline   [   3% ] 1/5 VUs  0m06.0s/3m00.0s

running (0m07.0s), 1/5 VUs, 12 complete and 0 interrupted iterations
baseline   [   4% ] 1/5 VUs  0m07.0s/3m00.0s

running (0m08.0s), 1/5 VUs, 14 complete and 0 interrupted iterations
baseline   [   4% ] 1/5 VUs  0m08.0s/3m00.0s

running (0m09.0s), 1/5 VUs, 15 complete and 0 interrupted iterations
baseline   [   5% ] 1/5 VUs  0m09.0s/3m00.0s

running (0m10.0s), 1/5 VUs, 17 complete and 0 interrupted iterations
baseline   [   6% ] 1/5 VUs  0m10.0s/3m00.0s

running (0m11.0s), 1/5 VUs, 18 complete and 0 interrupted iterations
baseline   [   6% ] 1/5 VUs  0m11.0s/3m00.0s

running (0m12.0s), 1/5 VUs, 20 complete and 0 interrupted iterations
baseline   [   7% ] 1/5 VUs  0m12.0s/3m00.0s

running (0m13.0s), 1/5 VUs, 21 complete and 0 interrupted iterations
baseline   [   7% ] 1/5 VUs  0m13.0s/3m00.0s

running (0m14.0s), 1/5 VUs, 23 complete and 0 interrupted iterations
baseline   [   8% ] 1/5 VUs  0m14.0s/3m00.0s

running (0m15.0s), 1/5 VUs, 24 complete and 0 interrupted iterations
baseline   [   8% ] 1/5 VUs  0m15.0s/3m00.0s

running (0m16.0s), 2/5 VUs, 27 complete and 0 interrupted iterations
baseline   [   9% ] 2/5 VUs  0m16.0s/3m00.0s

running (0m17.0s), 2/5 VUs, 29 complete and 0 interrupted iterations
baseline   [   9% ] 2/5 VUs  0m17.0s/3m00.0s

running (0m18.0s), 2/5 VUs, 32 complete and 0 interrupted iterations
baseline   [  10% ] 2/5 VUs  0m18.0s/3m00.0s

running (0m19.0s), 2/5 VUs, 35 complete and 0 interrupted iterations
baseline   [  11% ] 2/5 VUs  0m19.0s/3m00.0s

running (0m20.0s), 2/5 VUs, 39 complete and 0 interrupted iterations
baseline   [  11% ] 2/5 VUs  0m20.0s/3m00.0s

running (0m21.0s), 2/5 VUs, 42 complete and 0 interrupted iterations
baseline   [  12% ] 2/5 VUs  0m21.0s/3m00.0s

running (0m22.0s), 2/5 VUs, 45 complete and 0 interrupted iterations
baseline   [  12% ] 2/5 VUs  0m22.0s/3m00.0s

running (0m23.0s), 2/5 VUs, 47 complete and 0 interrupted iterations
baseline   [  13% ] 2/5 VUs  0m23.0s/3m00.0s

running (0m24.0s), 2/5 VUs, 50 complete and 0 interrupted iterations
baseline   [  13% ] 2/5 VUs  0m24.0s/3m00.0s

running (0m25.0s), 2/5 VUs, 53 complete and 0 interrupted iterations
baseline   [  14% ] 2/5 VUs  0m25.0s/3m00.0s

running (0m26.0s), 2/5 VUs, 56 complete and 0 interrupted iterations
baseline   [  14% ] 2/5 VUs  0m26.0s/3m00.0s

running (0m27.0s), 2/5 VUs, 60 complete and 0 interrupted iterations
baseline   [  15% ] 2/5 VUs  0m27.0s/3m00.0s

running (0m28.0s), 2/5 VUs, 63 complete and 0 interrupted iterations
baseline   [  16% ] 2/5 VUs  0m28.0s/3m00.0s

running (0m29.0s), 2/5 VUs, 65 complete and 0 interrupted iterations
baseline   [  16% ] 2/5 VUs  0m29.0s/3m00.0s

running (0m30.0s), 2/5 VUs, 68 complete and 0 interrupted iterations
baseline   [  17% ] 2/5 VUs  0m30.0s/3m00.0s

running (0m31.0s), 3/5 VUs, 73 complete and 0 interrupted iterations
baseline   [  17% ] 3/5 VUs  0m31.0s/3m00.0s

running (0m32.0s), 3/5 VUs, 76 complete and 0 interrupted iterations
baseline   [  18% ] 3/5 VUs  0m32.0s/3m00.0s

running (0m33.0s), 3/5 VUs, 81 complete and 0 interrupted iterations
baseline   [  18% ] 3/5 VUs  0m33.0s/3m00.0s

running (0m34.0s), 3/5 VUs, 85 complete and 0 interrupted iterations
baseline   [  19% ] 3/5 VUs  0m34.0s/3m00.0s

running (0m35.0s), 3/5 VUs, 89 complete and 0 interrupted iterations
baseline   [  19% ] 3/5 VUs  0m35.0s/3m00.0s

running (0m36.0s), 3/5 VUs, 93 complete and 0 interrupted iterations
baseline   [  20% ] 3/5 VUs  0m36.0s/3m00.0s

running (0m37.0s), 3/5 VUs, 98 complete and 0 interrupted iterations
baseline   [  21% ] 3/5 VUs  0m37.0s/3m00.0s

running (0m38.0s), 3/5 VUs, 102 complete and 0 interrupted iterations
baseline   [  21% ] 3/5 VUs  0m38.0s/3m00.0s

running (0m39.0s), 3/5 VUs, 108 complete and 0 interrupted iterations
baseline   [  22% ] 3/5 VUs  0m39.0s/3m00.0s

running (0m40.0s), 3/5 VUs, 111 complete and 0 interrupted iterations
baseline   [  22% ] 3/5 VUs  0m40.0s/3m00.0s

running (0m41.0s), 3/5 VUs, 118 complete and 0 interrupted iterations
baseline   [  23% ] 3/5 VUs  0m41.0s/3m00.0s

running (0m42.0s), 3/5 VUs, 122 complete and 0 interrupted iterations
baseline   [  23% ] 3/5 VUs  0m42.0s/3m00.0s

running (0m43.0s), 3/5 VUs, 126 complete and 0 interrupted iterations
baseline   [  24% ] 3/5 VUs  0m43.0s/3m00.0s

running (0m44.0s), 3/5 VUs, 131 complete and 0 interrupted iterations
baseline   [  24% ] 3/5 VUs  0m44.0s/3m00.0s

running (0m45.0s), 3/5 VUs, 134 complete and 0 interrupted iterations
baseline   [  25% ] 3/5 VUs  0m45.0s/3m00.0s

running (0m46.0s), 3/5 VUs, 140 complete and 0 interrupted iterations
baseline   [  26% ] 3/5 VUs  0m46.0s/3m00.0s

running (0m47.0s), 3/5 VUs, 145 complete and 0 interrupted iterations
baseline   [  26% ] 3/5 VUs  0m47.0s/3m00.0s

running (0m48.0s), 3/5 VUs, 150 complete and 0 interrupted iterations
baseline   [  27% ] 3/5 VUs  0m48.0s/3m00.0s

running (0m49.0s), 3/5 VUs, 153 complete and 0 interrupted iterations
baseline   [  27% ] 3/5 VUs  0m49.0s/3m00.0s

running (0m50.0s), 3/5 VUs, 156 complete and 0 interrupted iterations
baseline   [  28% ] 3/5 VUs  0m50.0s/3m00.0s

running (0m51.0s), 3/5 VUs, 162 complete and 0 interrupted iterations
baseline   [  28% ] 3/5 VUs  0m51.0s/3m00.0s

running (0m52.0s), 3/5 VUs, 167 complete and 0 interrupted iterations
baseline   [  29% ] 3/5 VUs  0m52.0s/3m00.0s

running (0m53.0s), 3/5 VUs, 171 complete and 0 interrupted iterations
baseline   [  29% ] 3/5 VUs  0m53.0s/3m00.0s

running (0m54.0s), 3/5 VUs, 175 complete and 0 interrupted iterations
baseline   [  30% ] 3/5 VUs  0m54.0s/3m00.0s

running (0m55.0s), 3/5 VUs, 178 complete and 0 interrupted iterations
baseline   [  31% ] 3/5 VUs  0m55.0s/3m00.0s

running (0m56.0s), 3/5 VUs, 185 complete and 0 interrupted iterations
baseline   [  31% ] 3/5 VUs  0m56.0s/3m00.0s

running (0m57.0s), 3/5 VUs, 189 complete and 0 interrupted iterations
baseline   [  32% ] 3/5 VUs  0m57.0s/3m00.0s

running (0m58.0s), 3/5 VUs, 193 complete and 0 interrupted iterations
baseline   [  32% ] 3/5 VUs  0m58.0s/3m00.0s

running (0m59.0s), 3/5 VUs, 197 complete and 0 interrupted iterations
baseline   [  33% ] 3/5 VUs  0m59.0s/3m00.0s

running (1m00.0s), 3/5 VUs, 202 complete and 0 interrupted iterations
baseline   [  33% ] 3/5 VUs  1m00.0s/3m00.0s

running (1m01.0s), 3/5 VUs, 207 complete and 0 interrupted iterations
baseline   [  34% ] 3/5 VUs  1m01.0s/3m00.0s

running (1m02.0s), 3/5 VUs, 212 complete and 0 interrupted iterations
baseline   [  34% ] 3/5 VUs  1m02.0s/3m00.0s

running (1m03.0s), 3/5 VUs, 217 complete and 0 interrupted iterations
baseline   [  35% ] 3/5 VUs  1m03.0s/3m00.0s

running (1m04.0s), 3/5 VUs, 221 complete and 0 interrupted iterations
baseline   [  36% ] 3/5 VUs  1m04.0s/3m00.0s

running (1m05.0s), 3/5 VUs, 227 complete and 0 interrupted iterations
baseline   [  36% ] 3/5 VUs  1m05.0s/3m00.0s

running (1m06.0s), 3/5 VUs, 231 complete and 0 interrupted iterations
baseline   [  37% ] 3/5 VUs  1m06.0s/3m00.0s

running (1m07.0s), 3/5 VUs, 237 complete and 0 interrupted iterations
baseline   [  37% ] 3/5 VUs  1m07.0s/3m00.0s

running (1m08.0s), 3/5 VUs, 241 complete and 0 interrupted iterations
baseline   [  38% ] 3/5 VUs  1m08.0s/3m00.0s

running (1m09.0s), 3/5 VUs, 246 complete and 0 interrupted iterations
baseline   [  38% ] 3/5 VUs  1m09.0s/3m00.0s

running (1m10.0s), 3/5 VUs, 252 complete and 0 interrupted iterations
baseline   [  39% ] 3/5 VUs  1m10.0s/3m00.0s

running (1m11.0s), 3/5 VUs, 256 complete and 0 interrupted iterations
baseline   [  39% ] 3/5 VUs  1m11.0s/3m00.0s

running (1m12.0s), 3/5 VUs, 261 complete and 0 interrupted iterations
baseline   [  40% ] 3/5 VUs  1m12.0s/3m00.0s

running (1m13.0s), 3/5 VUs, 265 complete and 0 interrupted iterations
baseline   [  41% ] 3/5 VUs  1m13.0s/3m00.0s

running (1m14.0s), 3/5 VUs, 270 complete and 0 interrupted iterations
baseline   [  41% ] 3/5 VUs  1m14.0s/3m00.0s

running (1m15.0s), 3/5 VUs, 274 complete and 0 interrupted iterations
baseline   [  42% ] 3/5 VUs  1m15.0s/3m00.0s

running (1m16.0s), 3/5 VUs, 278 complete and 0 interrupted iterations
baseline   [  42% ] 3/5 VUs  1m16.0s/3m00.0s

running (1m17.0s), 3/5 VUs, 282 complete and 0 interrupted iterations
baseline   [  43% ] 3/5 VUs  1m17.0s/3m00.0s

running (1m18.0s), 3/5 VUs, 286 complete and 0 interrupted iterations
baseline   [  43% ] 3/5 VUs  1m18.0s/3m00.0s

running (1m19.0s), 3/5 VUs, 292 complete and 0 interrupted iterations
baseline   [  44% ] 3/5 VUs  1m19.0s/3m00.0s

running (1m20.0s), 3/5 VUs, 297 complete and 0 interrupted iterations
baseline   [  44% ] 3/5 VUs  1m20.0s/3m00.0s

running (1m21.0s), 3/5 VUs, 301 complete and 0 interrupted iterations
baseline   [  45% ] 3/5 VUs  1m21.0s/3m00.0s

running (1m22.0s), 3/5 VUs, 307 complete and 0 interrupted iterations
baseline   [  46% ] 3/5 VUs  1m22.0s/3m00.0s

running (1m23.0s), 3/5 VUs, 312 complete and 0 interrupted iterations
baseline   [  46% ] 3/5 VUs  1m23.0s/3m00.0s

running (1m24.0s), 3/5 VUs, 317 complete and 0 interrupted iterations
baseline   [  47% ] 3/5 VUs  1m24.0s/3m00.0s

running (1m25.0s), 3/5 VUs, 321 complete and 0 interrupted iterations
baseline   [  47% ] 3/5 VUs  1m25.0s/3m00.0s

running (1m26.0s), 3/5 VUs, 324 complete and 0 interrupted iterations
baseline   [  48% ] 3/5 VUs  1m26.0s/3m00.0s

running (1m27.0s), 3/5 VUs, 329 complete and 0 interrupted iterations
baseline   [  48% ] 3/5 VUs  1m27.0s/3m00.0s

running (1m28.0s), 3/5 VUs, 334 complete and 0 interrupted iterations
baseline   [  49% ] 3/5 VUs  1m28.0s/3m00.0s

running (1m29.0s), 3/5 VUs, 341 complete and 0 interrupted iterations
baseline   [  49% ] 3/5 VUs  1m29.0s/3m00.0s

running (1m30.0s), 3/5 VUs, 347 complete and 0 interrupted iterations
baseline   [  50% ] 3/5 VUs  1m30.0s/3m00.0s

running (1m31.0s), 4/5 VUs, 352 complete and 0 interrupted iterations
baseline   [  51% ] 4/5 VUs  1m31.0s/3m00.0s

running (1m32.0s), 4/5 VUs, 358 complete and 0 interrupted iterations
baseline   [  51% ] 4/5 VUs  1m32.0s/3m00.0s

running (1m33.0s), 4/5 VUs, 364 complete and 0 interrupted iterations
baseline   [  52% ] 4/5 VUs  1m33.0s/3m00.0s

running (1m34.0s), 4/5 VUs, 371 complete and 0 interrupted iterations
baseline   [  52% ] 4/5 VUs  1m34.0s/3m00.0s

running (1m35.0s), 4/5 VUs, 377 complete and 0 interrupted iterations
baseline   [  53% ] 4/5 VUs  1m35.0s/3m00.0s

running (1m36.0s), 4/5 VUs, 384 complete and 0 interrupted iterations
baseline   [  53% ] 4/5 VUs  1m36.0s/3m00.0s

running (1m37.0s), 4/5 VUs, 389 complete and 0 interrupted iterations
baseline   [  54% ] 4/5 VUs  1m37.0s/3m00.0s

running (1m38.0s), 4/5 VUs, 397 complete and 0 interrupted iterations
baseline   [  54% ] 4/5 VUs  1m38.0s/3m00.0s

running (1m39.0s), 4/5 VUs, 404 complete and 0 interrupted iterations
baseline   [  55% ] 4/5 VUs  1m39.0s/3m00.0s

running (1m40.0s), 4/5 VUs, 409 complete and 0 interrupted iterations
baseline   [  56% ] 4/5 VUs  1m40.0s/3m00.0s

running (1m41.0s), 4/5 VUs, 415 complete and 0 interrupted iterations
baseline   [  56% ] 4/5 VUs  1m41.0s/3m00.0s

running (1m42.0s), 4/5 VUs, 421 complete and 0 interrupted iterations
baseline   [  57% ] 4/5 VUs  1m42.0s/3m00.0s

running (1m43.0s), 4/5 VUs, 427 complete and 0 interrupted iterations
baseline   [  57% ] 4/5 VUs  1m43.0s/3m00.0s

running (1m44.0s), 4/5 VUs, 434 complete and 0 interrupted iterations
baseline   [  58% ] 4/5 VUs  1m44.0s/3m00.0s

running (1m45.0s), 4/5 VUs, 439 complete and 0 interrupted iterations
baseline   [  58% ] 4/5 VUs  1m45.0s/3m00.0s

running (1m46.0s), 4/5 VUs, 445 complete and 0 interrupted iterations
baseline   [  59% ] 4/5 VUs  1m46.0s/3m00.0s

running (1m47.0s), 4/5 VUs, 454 complete and 0 interrupted iterations
baseline   [  59% ] 4/5 VUs  1m47.0s/3m00.0s

running (1m48.0s), 4/5 VUs, 459 complete and 0 interrupted iterations
baseline   [  60% ] 4/5 VUs  1m48.0s/3m00.0s

running (1m49.0s), 4/5 VUs, 464 complete and 0 interrupted iterations
baseline   [  61% ] 4/5 VUs  1m49.0s/3m00.0s

running (1m50.0s), 4/5 VUs, 469 complete and 0 interrupted iterations
baseline   [  61% ] 4/5 VUs  1m50.0s/3m00.0s

running (1m51.0s), 4/5 VUs, 475 complete and 0 interrupted iterations
baseline   [  62% ] 4/5 VUs  1m51.0s/3m00.0s

running (1m52.0s), 4/5 VUs, 481 complete and 0 interrupted iterations
baseline   [  62% ] 4/5 VUs  1m52.0s/3m00.0s

running (1m53.0s), 4/5 VUs, 486 complete and 0 interrupted iterations
baseline   [  63% ] 4/5 VUs  1m53.0s/3m00.0s

running (1m54.0s), 4/5 VUs, 493 complete and 0 interrupted iterations
baseline   [  63% ] 4/5 VUs  1m54.0s/3m00.0s

running (1m55.0s), 4/5 VUs, 502 complete and 0 interrupted iterations
baseline   [  64% ] 4/5 VUs  1m55.0s/3m00.0s

running (1m56.0s), 4/5 VUs, 507 complete and 0 interrupted iterations
baseline   [  64% ] 4/5 VUs  1m56.0s/3m00.0s

running (1m57.0s), 4/5 VUs, 512 complete and 0 interrupted iterations
baseline   [  65% ] 4/5 VUs  1m57.0s/3m00.0s

running (1m58.0s), 4/5 VUs, 520 complete and 0 interrupted iterations
baseline   [  66% ] 4/5 VUs  1m58.0s/3m00.0s

running (1m59.0s), 4/5 VUs, 526 complete and 0 interrupted iterations
baseline   [  66% ] 4/5 VUs  1m59.0s/3m00.0s

running (2m00.0s), 4/5 VUs, 534 complete and 0 interrupted iterations
baseline   [  67% ] 4/5 VUs  2m00.0s/3m00.0s

running (2m01.0s), 4/5 VUs, 540 complete and 0 interrupted iterations
baseline   [  67% ] 4/5 VUs  2m01.0s/3m00.0s

running (2m02.0s), 4/5 VUs, 545 complete and 0 interrupted iterations
baseline   [  68% ] 4/5 VUs  2m02.0s/3m00.0s

running (2m03.0s), 4/5 VUs, 551 complete and 0 interrupted iterations
baseline   [  68% ] 4/5 VUs  2m03.0s/3m00.0s

running (2m04.0s), 4/5 VUs, 559 complete and 0 interrupted iterations
baseline   [  69% ] 4/5 VUs  2m04.0s/3m00.0s

running (2m05.0s), 4/5 VUs, 565 complete and 0 interrupted iterations
baseline   [  69% ] 4/5 VUs  2m05.0s/3m00.0s

running (2m06.0s), 4/5 VUs, 570 complete and 0 interrupted iterations
baseline   [  70% ] 4/5 VUs  2m06.0s/3m00.0s

running (2m07.0s), 4/5 VUs, 576 complete and 0 interrupted iterations
baseline   [  71% ] 4/5 VUs  2m07.0s/3m00.0s

running (2m08.0s), 4/5 VUs, 582 complete and 0 interrupted iterations
baseline   [  71% ] 4/5 VUs  2m08.0s/3m00.0s

running (2m09.0s), 4/5 VUs, 590 complete and 0 interrupted iterations
baseline   [  72% ] 4/5 VUs  2m09.0s/3m00.0s

running (2m10.0s), 4/5 VUs, 595 complete and 0 interrupted iterations
baseline   [  72% ] 4/5 VUs  2m10.0s/3m00.0s

running (2m11.0s), 4/5 VUs, 603 complete and 0 interrupted iterations
baseline   [  73% ] 4/5 VUs  2m11.0s/3m00.0s

running (2m12.0s), 4/5 VUs, 609 complete and 0 interrupted iterations
baseline   [  73% ] 4/5 VUs  2m12.0s/3m00.0s

running (2m13.0s), 4/5 VUs, 613 complete and 0 interrupted iterations
baseline   [  74% ] 4/5 VUs  2m13.0s/3m00.0s

running (2m14.0s), 4/5 VUs, 620 complete and 0 interrupted iterations
baseline   [  74% ] 4/5 VUs  2m14.0s/3m00.0s

running (2m15.0s), 4/5 VUs, 624 complete and 0 interrupted iterations
baseline   [  75% ] 4/5 VUs  2m15.0s/3m00.0s

running (2m16.0s), 4/5 VUs, 631 complete and 0 interrupted iterations
baseline   [  76% ] 4/5 VUs  2m16.0s/3m00.0s

running (2m17.0s), 4/5 VUs, 636 complete and 0 interrupted iterations
baseline   [  76% ] 4/5 VUs  2m17.0s/3m00.0s

running (2m18.0s), 4/5 VUs, 644 complete and 0 interrupted iterations
baseline   [  77% ] 4/5 VUs  2m18.0s/3m00.0s

running (2m19.0s), 4/5 VUs, 651 complete and 0 interrupted iterations
baseline   [  77% ] 4/5 VUs  2m19.0s/3m00.0s

running (2m20.0s), 4/5 VUs, 658 complete and 0 interrupted iterations
baseline   [  78% ] 4/5 VUs  2m20.0s/3m00.0s

running (2m21.0s), 4/5 VUs, 663 complete and 0 interrupted iterations
baseline   [  78% ] 4/5 VUs  2m21.0s/3m00.0s

running (2m22.0s), 4/5 VUs, 670 complete and 0 interrupted iterations
baseline   [  79% ] 4/5 VUs  2m22.0s/3m00.0s

running (2m23.0s), 4/5 VUs, 675 complete and 0 interrupted iterations
baseline   [  79% ] 4/5 VUs  2m23.0s/3m00.0s

running (2m24.0s), 4/5 VUs, 684 complete and 0 interrupted iterations
baseline   [  80% ] 4/5 VUs  2m24.0s/3m00.0s

running (2m25.0s), 4/5 VUs, 691 complete and 0 interrupted iterations
baseline   [  81% ] 4/5 VUs  2m25.0s/3m00.0s

running (2m26.0s), 4/5 VUs, 695 complete and 0 interrupted iterations
baseline   [  81% ] 4/5 VUs  2m26.0s/3m00.0s

running (2m27.0s), 4/5 VUs, 701 complete and 0 interrupted iterations
baseline   [  82% ] 4/5 VUs  2m27.0s/3m00.0s

running (2m28.0s), 4/5 VUs, 707 complete and 0 interrupted iterations
baseline   [  82% ] 4/5 VUs  2m28.0s/3m00.0s

running (2m29.0s), 4/5 VUs, 712 complete and 0 interrupted iterations
baseline   [  83% ] 4/5 VUs  2m29.0s/3m00.0s

running (2m30.0s), 4/5 VUs, 718 complete and 0 interrupted iterations
baseline   [  83% ] 4/5 VUs  2m30.0s/3m00.0s

running (2m31.0s), 5/5 VUs, 725 complete and 0 interrupted iterations
baseline   [  84% ] 5/5 VUs  2m31.0s/3m00.0s

running (2m32.0s), 5/5 VUs, 734 complete and 0 interrupted iterations
baseline   [  84% ] 5/5 VUs  2m32.0s/3m00.0s

running (2m33.0s), 5/5 VUs, 743 complete and 0 interrupted iterations
baseline   [  85% ] 5/5 VUs  2m33.0s/3m00.0s

running (2m34.0s), 5/5 VUs, 751 complete and 0 interrupted iterations
baseline   [  86% ] 5/5 VUs  2m34.0s/3m00.0s

running (2m35.0s), 5/5 VUs, 758 complete and 0 interrupted iterations
baseline   [  86% ] 5/5 VUs  2m35.0s/3m00.0s

running (2m36.0s), 5/5 VUs, 766 complete and 0 interrupted iterations
baseline   [  87% ] 5/5 VUs  2m36.0s/3m00.0s

running (2m37.0s), 4/5 VUs, 772 complete and 0 interrupted iterations
baseline   [  87% ] 4/5 VUs  2m37.0s/3m00.0s

running (2m38.0s), 4/5 VUs, 780 complete and 0 interrupted iterations
baseline   [  88% ] 4/5 VUs  2m38.0s/3m00.0s

running (2m39.0s), 4/5 VUs, 786 complete and 0 interrupted iterations
baseline   [  88% ] 4/5 VUs  2m39.0s/3m00.0s

running (2m40.0s), 4/5 VUs, 794 complete and 0 interrupted iterations
baseline   [  89% ] 4/5 VUs  2m40.0s/3m00.0s

running (2m41.0s), 4/5 VUs, 798 complete and 0 interrupted iterations
baseline   [  89% ] 4/5 VUs  2m41.0s/3m00.0s

running (2m42.0s), 4/5 VUs, 805 complete and 0 interrupted iterations
baseline   [  90% ] 4/5 VUs  2m42.0s/3m00.0s

running (2m43.0s), 3/5 VUs, 810 complete and 0 interrupted iterations
baseline   [  91% ] 3/5 VUs  2m43.0s/3m00.0s

running (2m44.0s), 3/5 VUs, 815 complete and 0 interrupted iterations
baseline   [  91% ] 3/5 VUs  2m44.0s/3m00.0s

running (2m45.0s), 3/5 VUs, 818 complete and 0 interrupted iterations
baseline   [  92% ] 3/5 VUs  2m45.0s/3m00.0s

running (2m46.0s), 3/5 VUs, 824 complete and 0 interrupted iterations
baseline   [  92% ] 3/5 VUs  2m46.0s/3m00.0s

running (2m47.0s), 3/5 VUs, 828 complete and 0 interrupted iterations
baseline   [  93% ] 3/5 VUs  2m47.0s/3m00.0s

running (2m48.0s), 3/5 VUs, 833 complete and 0 interrupted iterations
baseline   [  93% ] 3/5 VUs  2m48.0s/3m00.0s

running (2m49.0s), 2/5 VUs, 836 complete and 0 interrupted iterations
baseline   [  94% ] 2/5 VUs  2m49.0s/3m00.0s

running (2m50.0s), 2/5 VUs, 839 complete and 0 interrupted iterations
baseline   [  94% ] 2/5 VUs  2m50.0s/3m00.0s

running (2m51.0s), 2/5 VUs, 841 complete and 0 interrupted iterations
baseline   [  95% ] 2/5 VUs  2m51.0s/3m00.0s

running (2m52.0s), 2/5 VUs, 845 complete and 0 interrupted iterations
baseline   [  96% ] 2/5 VUs  2m52.0s/3m00.0s

running (2m53.0s), 2/5 VUs, 847 complete and 0 interrupted iterations
baseline   [  96% ] 2/5 VUs  2m53.0s/3m00.0s

running (2m54.0s), 2/5 VUs, 851 complete and 0 interrupted iterations
baseline   [  97% ] 2/5 VUs  2m54.0s/3m00.0s

running (2m55.0s), 1/5 VUs, 854 complete and 0 interrupted iterations
baseline   [  97% ] 1/5 VUs  2m55.0s/3m00.0s

running (2m56.0s), 1/5 VUs, 856 complete and 0 interrupted iterations
baseline   [  98% ] 1/5 VUs  2m56.0s/3m00.0s

running (2m57.0s), 1/5 VUs, 858 complete and 0 interrupted iterations
baseline   [  98% ] 1/5 VUs  2m57.0s/3m00.0s

running (2m58.0s), 1/5 VUs, 859 complete and 0 interrupted iterations
baseline   [  99% ] 1/5 VUs  2m58.0s/3m00.0s

running (2m59.0s), 1/5 VUs, 861 complete and 0 interrupted iterations
baseline   [  99% ] 1/5 VUs  2m59.0s/3m00.0s

running (3m00.0s), 1/5 VUs, 862 complete and 0 interrupted iterations
baseline   [ 100% ] 1/5 VUs  3m00.0s/3m00.0s


  █ THRESHOLDS

    checks
    ✓ 'rate>0.98' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1200' p(95)=13.14ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 8630    47.783387/s
    checks_succeeded...: 100.00% 8630 out of 8630
    checks_failed......: 0.00%   0 out of 8630

    ✓ live status is 200
    ✓ ready status is 200
    ✓ ready database is ok
    ✓ version status is 200
    ✓ product created
    ✓ product has id
    ✓ order created
    ✓ order has id
    ✓ checkout completed
    ✓ checkout status checked_out

    HTTP
    http_req_duration..............: avg=6.15ms   min=987.41µs med=6.5ms    max=62.9ms p(90)=11.19ms  p(95)=13.14ms
      { expected_response:true }...: avg=6.15ms   min=987.41µs med=6.5ms    max=62.9ms p(90)=11.19ms  p(95)=13.14ms
    http_req_failed................: 0.00%  0 out of 5178
    http_reqs......................: 5178   28.670032/s

    EXECUTION
    iteration_duration.............: avg=645.44ms min=233.83ms med=652.82ms max=1.05s  p(90)=956.37ms p(95)=997.8ms
    iterations.....................: 863    4.778339/s
    vus............................: 1      min=1         max=5
    vus_max........................: 5      min=5         max=5

    NETWORK
    data_received..................: 1.2 MB 6.6 kB/s
    data_sent......................: 678 kB 3.8 kB/s



running (3m00.6s), 0/5 VUs, 863 complete and 0 interrupted iterations
baseline ✓ [ 100% ] 0/5 VUs  3m0s